package variables

import "sync"

var (
	UserSessions      = make(map[int64]string)
	UserSessionsMutex = &sync.Mutex{}
)

var Periods = map[int]string{
	1:  "23 декабря - 12 января",
	2:  "13 января - 02 февраля",
	3:  "03 февраля - 16 февраля",
	4:  "17 февраля - 09 марта",
	5:  "10 марта - 30 марта",
	6:  "31 марта - 20 апреля",
	7:  "21 апреля - 11 мая",
	8:  "12 мая - 01 июня",
	9:  "02 июня - 22 июня",
	10: "23 июня - 13 июля",
	11: "14 июля - 03 августа",
	12: "04 августа - 24 августа",
	13: "25 августа - 14 сентября",
	14: "15 сентября - 28 сентября",
	15: "29 сентября - 19 октября",
	16: "20 октября - 09 ноября",
	17: "10 ноября - 23 ноября",
	18: "24 ноября - 14 декабря",
	19: "15 декабря - 04 января",
}
